#include <stdio.h>

int main(void)
{
    double a;
    double sum;

    while (scanf("%lf", &a) != EOF)
    {
        sum = 0;
        
        if (a <= 3000)/*不超过3000元的部分*/
        {
            sum = a * 0.03;
        }

        else if(a > 3000 && a <= 12000)/*超过3000元至12000元的部分*/
        {
            sum = 90 + (a - 3000) * 0.1;
        }

        else if(a > 12000 && a <= 25000)/*超过12000元至25000元的部分*/
        {
            sum = 90 + 900 + (a - 12000) * 0.2;
        }
        else if(a > 25000 && a <= 35000)/*超过25000元至35000元的部分*/
        {
            sum = 90 + 900 + 2600 + (a - 25000) * 0.25;
        }

        else if(a > 35000 && a <= 55000)/*超过35000元至55000元的部分*/
        {
            sum = 90 + 900 + 2600 + 2500 + (a - 35000) * 0.3;
        }

        else if(a > 55000 && a <= 80000)/*超过55000元至80000元的部分*/
        {
            sum = 90 + 900 + 2600 + 2500 + 6000 + (a - 55000) * 0.35;
        }

        else if(a > 80000)/*超过80000元的部分*/
        {
            sum = 90 + 900 + 2600 + 2500 + 6000 + 8750 + (a - 80000) * 0.45;
        }

        sum = a - sum;

        printf("%.2lf\n", sum);    

    }   

    return 0;
}